; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v2 ?v4)
             (pred_4 ?v5 ?v12)
             (pred_5 ?v2 ?v12)
             (pred_2 ?v3 ?v2 )
	     (pred_12 ?v2)
             (pred_6 ?v8)
             (pred_11 ?v5)
             (pred_8 ?v12)
             (pred_7 ?v2)
             (pred_3 ?v5)
             (pred_1 ?v2)
             (pred_10 ))



(:action op_2
:parameters (?v11 ?v7 ?v6 ?v13)
:precondition (and (pred_6 ?v11) (pred_6 ?v7) (pred_11 ?v6) (pred_8 ?v13)
          (pred_9 ?v11 ?v7) (pred_4 ?v6 ?v13)
                   (pred_5 ?v7 ?v13) (pred_12 ?v11) 
                   (pred_7 ?v7) (pred_3 ?v6))
:effect (and  (pred_1 ?v7) (not (pred_7 ?v7))))


(:action op_4
:parameters (?v11 ?v9)
:precondition (and (pred_6 ?v11) (pred_6 ?v9)
               (pred_12 ?v11) (pred_9 ?v11 ?v9) (pred_1 ?v9))
:effect (and (pred_12 ?v9) (not (pred_12 ?v11))))

(:action op_1
:parameters (?v11 ?v6)
:precondition (and (pred_6 ?v11) (pred_11 ?v6) 
                  (pred_12 ?v11) (pred_2 ?v6 ?v11) (pred_10 ))
:effect (and (pred_3 ?v6)
   (not (pred_2 ?v6 ?v11)) (not (pred_10 ))))


(:action op_3
:parameters (?v11 ?v10 ?v1)
:precondition (and (pred_6 ?v11) (pred_11 ?v10) (pred_11 ?v1)
                  (pred_12 ?v11) (pred_3 ?v1) (pred_2 ?v10 ?v11))
:effect (and (pred_3 ?v10) (pred_2 ?v1 ?v11)
        (not (pred_3 ?v1)) (not (pred_2 ?v10 ?v11))))

(:action op_5
:parameters (?v11 ?v6)
:precondition (and (pred_6 ?v11) (pred_11 ?v6) 
                  (pred_12 ?v11) (pred_3 ?v6))
:effect (and (pred_10 ) (pred_2 ?v6 ?v11) (not (pred_3 ?v6)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_22 obj_13 obj_18 obj_20 obj_26 obj_32 obj_23 obj_10 obj_19 obj_05 obj_25 obj_03 obj_12 obj_16 obj_28 obj_29 obj_08 obj_30 obj_31 obj_27 obj_11 obj_06 obj_07 obj_01 obj_17
    obj_02 obj_21 obj_09
    obj_24 obj_14 obj_04 obj_15
    )

    (:init
       (pred_10)

       (pred_6 obj_22)
       (pred_6 obj_13)
       (pred_6 obj_18)
       (pred_6 obj_20)
       (pred_6 obj_26)
       (pred_6 obj_32)
       (pred_6 obj_23)
       (pred_6 obj_10)
       (pred_6 obj_19)
       (pred_6 obj_05)
       (pred_6 obj_25)
       (pred_6 obj_03)
       (pred_6 obj_12)
       (pred_6 obj_16)
       (pred_6 obj_28)
       (pred_6 obj_29)
       (pred_6 obj_08)
       (pred_6 obj_30)
       (pred_6 obj_31)
       (pred_6 obj_27)
       (pred_6 obj_11)
       (pred_6 obj_06)
       (pred_6 obj_07)
       (pred_6 obj_01)
       (pred_6 obj_17)
       (pred_8 obj_02)
       (pred_8 obj_21)
       (pred_8 obj_09)
       (pred_11 obj_24)
       (pred_11 obj_14)
       (pred_11 obj_04)
       (pred_11 obj_15)

       (pred_9 obj_22 obj_32)
       (pred_9 obj_22 obj_13)
       (pred_9 obj_13 obj_23)
       (pred_9 obj_13 obj_18)
       (pred_9 obj_13 obj_22)
       (pred_9 obj_18 obj_10)
       (pred_9 obj_18 obj_20)
       (pred_9 obj_18 obj_13)
       (pred_9 obj_20 obj_19)
       (pred_9 obj_20 obj_26)
       (pred_9 obj_20 obj_18)
       (pred_9 obj_26 obj_05)
       (pred_9 obj_26 obj_20)
       (pred_9 obj_32 obj_25)
       (pred_9 obj_32 obj_23)
       (pred_9 obj_32 obj_22)
       (pred_9 obj_23 obj_03)
       (pred_9 obj_23 obj_10)
       (pred_9 obj_23 obj_13)
       (pred_9 obj_23 obj_32)
       (pred_9 obj_10 obj_12)
       (pred_9 obj_10 obj_19)
       (pred_9 obj_10 obj_18)
       (pred_9 obj_10 obj_23)
       (pred_9 obj_19 obj_16)
       (pred_9 obj_19 obj_05)
       (pred_9 obj_19 obj_20)
       (pred_9 obj_19 obj_10)
       (pred_9 obj_05 obj_28)
       (pred_9 obj_05 obj_26)
       (pred_9 obj_05 obj_19)
       (pred_9 obj_25 obj_29)
       (pred_9 obj_25 obj_03)
       (pred_9 obj_25 obj_32)
       (pred_9 obj_03 obj_08)
       (pred_9 obj_03 obj_12)
       (pred_9 obj_03 obj_23)
       (pred_9 obj_03 obj_25)
       (pred_9 obj_12 obj_30)
       (pred_9 obj_12 obj_16)
       (pred_9 obj_12 obj_10)
       (pred_9 obj_12 obj_03)
       (pred_9 obj_16 obj_31)
       (pred_9 obj_16 obj_28)
       (pred_9 obj_16 obj_19)
       (pred_9 obj_16 obj_12)
       (pred_9 obj_28 obj_27)
       (pred_9 obj_28 obj_05)
       (pred_9 obj_28 obj_16)
       (pred_9 obj_29 obj_11)
       (pred_9 obj_29 obj_08)
       (pred_9 obj_29 obj_25)
       (pred_9 obj_08 obj_06)
       (pred_9 obj_08 obj_30)
       (pred_9 obj_08 obj_03)
       (pred_9 obj_08 obj_29)
       (pred_9 obj_30 obj_07)
       (pred_9 obj_30 obj_31)
       (pred_9 obj_30 obj_12)
       (pred_9 obj_30 obj_08)
       (pred_9 obj_31 obj_01)
       (pred_9 obj_31 obj_27)
       (pred_9 obj_31 obj_16)
       (pred_9 obj_31 obj_30)
       (pred_9 obj_27 obj_17)
       (pred_9 obj_27 obj_28)
       (pred_9 obj_27 obj_31)
       (pred_9 obj_11 obj_06)
       (pred_9 obj_11 obj_29)
       (pred_9 obj_06 obj_07)
       (pred_9 obj_06 obj_08)
       (pred_9 obj_06 obj_11)
       (pred_9 obj_07 obj_01)
       (pred_9 obj_07 obj_30)
       (pred_9 obj_07 obj_06)
       (pred_9 obj_01 obj_17)
       (pred_9 obj_01 obj_31)
       (pred_9 obj_01 obj_07)
       (pred_9 obj_17 obj_27)
       (pred_9 obj_17 obj_01)
       (pred_7 obj_19)
       (pred_7 obj_26)
       (pred_7 obj_01)
       (pred_7 obj_30)
       (pred_5  obj_19 obj_02)
       (pred_5  obj_26 obj_21)
       (pred_5  obj_01 obj_09)
       (pred_5  obj_30 obj_21)
       (pred_1 obj_22)
       (pred_1 obj_13)
       (pred_1 obj_18)
       (pred_1 obj_20)
       (pred_1 obj_32)
       (pred_1 obj_23)
       (pred_1 obj_10)
       (pred_1 obj_05)
       (pred_1 obj_25)
       (pred_1 obj_03)
       (pred_1 obj_12)
       (pred_1 obj_16)
       (pred_1 obj_28)
       (pred_1 obj_29)
       (pred_1 obj_08)
       (pred_1 obj_31)
       (pred_1 obj_27)
       (pred_1 obj_11)
       (pred_1 obj_06)
       (pred_1 obj_07)
       (pred_1 obj_17)

       (pred_4  obj_24 obj_02)
       (pred_4  obj_14 obj_21)
       (pred_4  obj_04 obj_09)
       (pred_4  obj_15 obj_21)
       (pred_2 obj_24 obj_16)
       (pred_2 obj_14 obj_08)
       (pred_2 obj_04 obj_22)
       (pred_2 obj_15 obj_20)
       (pred_12 obj_03)
    )

    (:goal (and
       (pred_2 obj_24 obj_08)
       (pred_2 obj_14 obj_29)
       (pred_2 obj_15 obj_10)
    ))
(:constraints
  (always (not (pred_12 obj_23)))
)
)

; plan
1. (op_4 obj_03 obj_12)
   deleted: (pred_12 obj_03)
   added: (pred_12 obj_12)
   goals met: 0 of 3
2. (op_4 obj_12 obj_16)
   deleted: (pred_12 obj_12)
   added: (pred_12 obj_16)
   goals met: 0 of 3
3. (op_1 obj_16 obj_24)
   deleted: (pred_2 obj_24 obj_16) (pred_10)
   added: (pred_3 obj_24)
   goals met: 0 of 3
4. (op_4 obj_16 obj_12)
   deleted: (pred_12 obj_16)
   added: (pred_12 obj_12)
   goals met: 0 of 3
5. (op_4 obj_12 obj_03)
   deleted: (pred_12 obj_12)
   added: (pred_12 obj_03)
   goals met: 0 of 3
6. (op_4 obj_03 obj_08)
   deleted: (pred_12 obj_03)
   added: (pred_12 obj_08)
   goals met: 0 of 3
7. (op_3 obj_08 obj_14 obj_24)
   deleted: (pred_3 obj_24) (pred_2 obj_14 obj_08)
   added: (pred_3 obj_14) (pred_2 obj_24 obj_08)
   goals met: 1 of 3
8. (op_2 obj_08 obj_30 obj_14 obj_21)
   deleted: (pred_7 obj_30)
   added: (pred_1 obj_30)
   goals met: 1 of 3
9. (op_4 obj_08 obj_30)
   deleted: (pred_12 obj_08)
   added: (pred_12 obj_30)
   goals met: 1 of 3
10. (op_4 obj_30 obj_12)
   deleted: (pred_12 obj_30)
   added: (pred_12 obj_12)
   goals met: 1 of 3
11. (op_4 obj_12 obj_10)
   deleted: (pred_12 obj_12)
   added: (pred_12 obj_10)
   goals met: 1 of 3
12. (op_4 obj_10 obj_18)
   deleted: (pred_12 obj_10)
   added: (pred_12 obj_18)
   goals met: 1 of 3
13. (op_4 obj_18 obj_20)
   deleted: (pred_12 obj_18)
   added: (pred_12 obj_20)
   goals met: 1 of 3
14. (op_3 obj_20 obj_15 obj_14)
   deleted: (pred_3 obj_14) (pred_2 obj_15 obj_20)
   added: (pred_3 obj_15) (pred_2 obj_14 obj_20)
   goals met: 1 of 3
15. (op_4 obj_20 obj_18)
   deleted: (pred_12 obj_20)
   added: (pred_12 obj_18)
   goals met: 1 of 3
16. (op_4 obj_18 obj_10)
   deleted: (pred_12 obj_18)
   added: (pred_12 obj_10)
   goals met: 1 of 3
17. (op_5 obj_10 obj_15)
   deleted: (pred_3 obj_15)
   added: (pred_10) (pred_2 obj_15 obj_10)
   goals met: 2 of 3
18. (op_4 obj_10 obj_18)
   deleted: (pred_12 obj_10)
   added: (pred_12 obj_18)
   goals met: 2 of 3
19. (op_4 obj_18 obj_20)
   deleted: (pred_12 obj_18)
   added: (pred_12 obj_20)
   goals met: 2 of 3
20. (op_1 obj_20 obj_14)
   deleted: (pred_2 obj_14 obj_20) (pred_10)
   added: (pred_3 obj_14)
   goals met: 2 of 3
21. (op_4 obj_20 obj_18)
   deleted: (pred_12 obj_20)
   added: (pred_12 obj_18)
   goals met: 2 of 3
22. (op_4 obj_18 obj_13)
   deleted: (pred_12 obj_18)
   added: (pred_12 obj_13)
   goals met: 2 of 3
23. (op_4 obj_13 obj_22)
   deleted: (pred_12 obj_13)
   added: (pred_12 obj_22)
   goals met: 2 of 3
24. (op_4 obj_22 obj_32)
   deleted: (pred_12 obj_22)
   added: (pred_12 obj_32)
   goals met: 2 of 3
25. (op_4 obj_32 obj_25)
   deleted: (pred_12 obj_32)
   added: (pred_12 obj_25)
   goals met: 2 of 3
26. (op_4 obj_25 obj_29)
   deleted: (pred_12 obj_25)
   added: (pred_12 obj_29)
   goals met: 2 of 3
27. (op_5 obj_29 obj_14)
   deleted: (pred_3 obj_14)
   added: (pred_10) (pred_2 obj_14 obj_29)
   goals met: 3 of 3
